app/views/portfolios/show.html.erb

	<h1>Technologies</h1>
	<% @portfolio_item.technologies.each do |technology| %>
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."portfolio_id" = $1  [["portfolio_id", 4]]