app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2022-08-15 13:15:13.631032"], ["updated_at", "2022-08-15 13:15:13.631032"], ["slug", "2a59d9fe-7e47-4ecf-97b1-c9eb43eb338c"], ["status", 0]]