app/controllers/portfolios_controller.rb

	def index
		@portfolio_items = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

	def create
    @portfolio_item = Portfolio.new(portfolio_params)
    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
  	@portfolio_item = Portfolio.find(params[:id])
    respond_to do |format|
      if @portfolio_item.update(portfolio_params)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "portfolios" SET "subtitle" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["subtitle", "My great service 1"], ["updated_at", "2022-08-10 19:53:02.642193"], ["id", 6]]

  def destroy
  	@portfolio_item = Portfolio.find(params[:id])
    @portfolio_item.destroy
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 1]]